tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
brew "bat"
brew "openssl@1.1"
brew "readline"
brew "xz"
brew "docker-completion"
brew "docker-compose-completion"
brew "exa"
brew "fd"
brew "unbound"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "gdk-pixbuf"
brew "git"
brew "go"
brew "helm"
brew "hledger"
brew "imagemagick"
brew "libgccjit"
brew "libmemcached"
brew "librsvg"
brew "neovim"
brew "ripgrep"
brew "starship"
brew "vault"
brew "zlib"
brew "zsh"
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-modern-pen-black-icon", "with-native-comp"]
brew "qmk/qmk/qmk"
cask "docker"
cask "font-fira-code-nerd-font"
cask "font-hasklug-nerd-font"
cask "hammerspoon"
cask "karabiner-elements"
cask "kitty"
cask "postman"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "thinkorswim"
cask "firefox"
cask "google-chrome"
