tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
brew "bat"
brew "exa"
brew "fd"
brew "fzf"
brew "git"
brew "hledger"
brew "neovim"
brew "ripgrep"
brew "starship"
brew "zsh"
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-modern-pen-black-icon", "with-native-comp"]
brew "qmk/qmk/qmk"
cask "docker"
cask "font-fira-code-nerd-font"
cask "font-hasklug-nerd-font"
cask "hammerspoon"
cask "karabiner-elements"
cask "kitty"
cask "postman"
cask "spotify"
